# coding=utf-8
# модуль для программного создания заданий
import datetime
from sworks.models import Task, TaskType, WorkType

# массив заданий
# название задания, программирование?, В классе?, дата выдачи, оценка 1, оценка 2, оценка 3, оценка 4, оценка 5
arr = [['02_Ведение в Java', 0, 0, '2016-09-12', '0,1,2', '3', '4', '5,6', '7'],
       ['02_Введение в Java_ДЗ', 0, 1, '2016-09-12', '0,1,2', '3', '4', '5,6', '7'],
       ['03_Условный оператор, оператор выбора, тернарные операции', 0, 0, '2016-09-19', '0,1,2', '3,4,5', '6,7,8',
        '10,9', '11'],
       ['03_Условный оператор, оператор выбора, тернарные операции (ДЗ)', 0, 1, '2016-09-19', '0,1,2', '3,4,5', '6,7,8',
        '10,9', '11'],
       ['04_while,do while в классе', 0, 0, '2016-09-26', '0,1,2', '3,4,5', '6,7', '8,9', '10'],
       ['04_Цикл while, do...while_ДЗ', 0, 1, '2016-09-26', '0,1,2', '3,4,5', '6,7,8', '10,9', '11'],
       ['05_Циклы for', 0, 0, '2016-10-03', '0,1,2', '3,4,5', '6,7,8', '10,9', '11'],
       ['05_Циклы for(ДЗ)', 0, 1, '2016-10-03', '0,1,2', '3,4,5', '6,7,8', '10,9', '11'],
       ['06_Массивы', 0, 0, '2016-10-10', '0,1,2', '3,4,5', '6,7,8', '10,9', '12,11'],
       ['06_Массивы_ДЗ', 0, 1, '2016-10-10', '0,1,2', '3,4,5', '6,7', '9,8', '10'],
       ['07_Строки', 0, 0, '2016-10-17', '0,1,2', '3,4,5', '6,7', '9,8', '10'],
       ['07_Строки_ДЗ', 0, 1, '2016-10-17', '0,1,2', '3,4,5', '6,7,8', '10,9', '12,11'],
       ['08_Строки, символы', 0, 0, '2016-10-24', '0,1,2', '3', '5,4', '7,6', '8'],
       ['08_Строки, символы_ДЗ', 0, 1, '2016-10-24', '0,1,2', '3,4', '5,6', '7,8', '9'],
       ['09_Методы', 0, 0, '2016-10-24', '0,1,2', '3,4', '5,6', '7,8', '9'],
       ['09_Методы_ДЗ', 0, 1, '2016-10-24', '0,1,2', '3', '4,5', '6,7', '8'],
       ['01_Модель вход-выход_тест ДЗ', 1, 1, '2016-09-07', '0', '0', '1', '2', '3'],
       ['02_Модель вход-выход 2_тест(в классе)', 1, 0, '2016-09-14', '0', '0', '1', '1.5', '2'],
       ['03_Комплексные числа(в классе)', 1, 0, '2016-09-21', '0', '0', '1', '2', '3'],
       ['03_Комплексные числа ДЗ_тест', 1, 1, '2016-09-21', '0', '0', '1', '2', '3'],
       ['04_Свободная составляющая', 1, 0, '2016-10-05', '0', '0', '1', '2', '3'],
       ['05_Матрицы', 1, 0, '2016-10-12', '0', '0', '1', '2', '3'],
       ['10_Рекурсия', 0, 0, '2016-11-07', '0,1', '3,2', '4,5', '6', '7'],
       ['10_Рекурсия_ДЗ', 0, 1, '2016-11-07', '0,1,2', '3,4', '5,6', '7,8', '9'],
       ['06_Определитель', 1, 0, '2016-11-09', '0', '1', '2', '3', '4'],
       ['06_Определитель_ДЗ', 1, 1, '2016-11-09', '0', '1', '2', '3', '4']]
# проходим по списку данных о заданиях
for a in arr:
    # находим переменную модели, соотв. типу задания: эссе или программирование
    tt = TaskType.objects.get(name="Программирование" if a[1] == 0 else "Эссе")
    # находим переменную модели, соотв. типу работы: в классе или дома
    wt = WorkType.objects.get(name="В классе" if a[1] == 0 else "Дома")
    # создаём задание
    t = Task(task_name=a[0], task_type=tt, work_type=wt, pub_date=datetime.datetime.strptime(a[3], "%Y-%m-%d").date(),
             est1=a[4], est2=a[5], est3=a[6], est4=a[7], est5=a[8])
    # сохраняем задание
    t.save()
