# coding=utf-8
import datetime

from sworks.models import Task

arr = [['02_Ведение в Java', 0, 0, '2016-09-12'],
       ['02_Введение в Java_ДЗ', 0, 1, '2016-09-12'],
       ['03_Условный оператор, оператор выбора, тернарные операции', 0, 0, '2016-09-19'],
       ['03_Условный оператор, оператор выбора, тернарные операции (ДЗ)', 0, 1, '2016-09-19'],
       ['04_while,do while в классе', 0, 0, '2016-09-26'],
       ['04_Цикл while, do...while_ДЗ', 0, 1, '2016-09-26'],
       ['05_Циклы for', 0, 0, '2016-10-03'],
       ['05_Циклы for(ДЗ)', 0, 1, '2016-10-03'],
       ['06_Массивы', 0, 0, '2016-10-10'],
       ['06_Массивы_ДЗ', 0, 1, '2016-10-10'],
       ['07_Строки', 0, 0, '2016-10-17'],
       ['07_Строки_ДЗ', 0, 1, '2016-10-17'],
       ['08_Строки, символы', 0, 0, '2016-10-24'],
       ['08_Строки, символы_ДЗ', 0, 1, '2016-10-24'],
       ['09_Методы', 0, 0, '2016-10-24'],
       ['09_Методы_ДЗ', 0, 1, '2016-10-24'],
       ['01_Модель вход-выход_тест ДЗ', 1, 1, '2016-09-07'],
       ['02_Модель вход-выход 2_тест(в классе)', 1, 0, '2016-09-14'],
       ['03_Комплексные числа(в классе)', 1, 0, '2016-09-21'],
       ['03_Комплексные числа ДЗ_тест', 1, 1, '2016-09-21'],
       ['04_Свободная составляющая', 1, 0, '2016-10-05'],
       ['05_Матрицы', 1, 0, '2016-10-12'],
       ['10_Рекурсия', 0, 0, '2016-11-07'],
       ['10_Рекурсия_ДЗ', 0, 1, '2016-11-07'],
       ['06_Определитель', 1, 0, '2016-11-09'],
       ['06_Определитель_ДЗ', 1, 1, '2016-11-09']]

for a in arr:
    t = Task(task_name=a[0], task_type=a[1], work_type=a[2], pub_date=datetime.datetime.strptime(a[3],"%Y-%m-%d").date())
    t.save()
